chapter_8.html

<div id="outline-container-orgc17e5ec" class="outline-3">
<h3 id="orgc17e5ec">Exercise 8.2 (Measurement as a quantum operation)</h3>
<div class="outline-text-3" id="text-orgc17e5ec">
<p>
Recall from Section 2.2.3 (on page 84) that a quantum measurement with outcomes labeled by
\(m\) is described by a set of measurement operators \(M_m\) such that
\(\sum_mM_m^\dagger\,M_m=I\). Let the state of the system immediately before the measurement
be \(\rho\). Show that for \(\calE_m(\rho)=M_m\rho\,M_m^\dagger\), the state of the system
immediately after the measurement is
</p>

<p>
\[
  \frac{\calE_m(\rho)}{\trace{\calE_m(\rho)}} .
\]
</p>

<p>
Also show that the probability of obtaining this measurement result is
\(p(m)=\trace{\calE_m(\rho)}\).
</p>
</div>

<div id="outline-container-org9672ad3" class="outline-4">
<h4 id="org9672ad3">Solution</h4>
<div class="outline-text-4" id="text-org9672ad3">
<p>
Clearly the exercise assumes that we only know the postulates of quantum mechanics for
<i>pure</i> states as detailed in section 2.2.3 and not the generalization to mixed states as
detailed in 2.4.1. Otherwise the exercise would be a trivial restatement of the evolution
and measurement postulates.
</p>

<p>
Let us first assume that \(\rho=\proj{\psi}\) is a pure state (just expressed as a density
matrix). In order to compute the trace of an operator \(\sigma\) we can take <i>any</i>
orthonormal basis \(\{e\}\) and have \(\trace{\sigma}=\sum_{e}\bra{e}\sigma\ket{e}\). Let
\(\sigma=\proj{\nu}\) with a not necessarily normalized non-zero \(\ket{\nu}\). Without loss
of generality we may assume that \(\ket{\nu}/\norm{\nu}\) is part of our chosen ONB (this
follows from the <a href="https://en.wikipedia.org/wiki/Gram%E2%80%93Schmidt_process">Gram-Schmidt</a> procedure). Hence
</p>

<p>
<a id="org75702e7"></a>
\[
  \trace{\sigma} = \sum_{e} \bra{e}\proj{\nu}\ket{e}
  = \sprod{\nu}{\nu} \sprod{\nu}{\nu} / \norm{\nu}^2
  = \norm{\nu}^2 .
\]
</p>

<p>
Given a state \(\ket{\psi}\) the post measurement state after measuring \(m\) is
\(M_m\ket{\psi}/\norm{M_m\ket{\psi}}\). From the reasoning in <a href="#exercise-8.1">exercise 1</a> (that \(U\) was a
unitary operator didn't really matter there) we deduce that the corresponding density
matrix is
</p>

<p>
\[
  \frac{M_m \rho M_m^\dagger}{\norm{M_m\ket{\psi}}^2} .
\]
</p>

<p>
Using <a href="#org75702e7">the equation</a> involving \(\sigma\) (with \(\ket{\nu}=M_m\ket{\psi}\)) we see that
\(\norm{M_m\ket{\psi}}^2=\trace{M_m\rho\,M_m^\dagger}\). Hence the post measurement state is
</p>

<p>
\[
  \frac{M_m \rho M_m^\dagger}{\trace{M_m\rho M_m^\dagger}} .
\]
</p>

<p>
The probability to measure \(m\) (and to obtain this state) is
</p>

<p>
\[
  p(m) = \norm{M_m\ket{\psi}}^2 = \trace{M_m \rho M_m^\dagger} .
\]
</p>

<p>
This concludes the exercise for pure states. Let \(\rho\) be a mixed state now. This means
that there is a decomposition
</p>

<p>
\[
  \rho = \sum_j p_j \proj{\psi_j}
\]
</p>

<p>
with strictly positive coefficients \(p_j\) such that \(\sum_jp_j=1\). The ensemble
interpretation says that having such a mixed state means that, upon measurement, one of
the pure states \(\ket{\psi_j}\) is taken at random with probability \(p_j\) and then the
measurement proceeds as in the pure state case. It is not a-priori clear that this is well
defined since the decomposition of \(\rho\) into pure states is not unique (c.f. Theorem 2.6
on page 103). But let us ignore this for the moment. We will see that the obtained
probabilities and the post measurement states are independent of the concrete
decomposition, hence the problem solves itself.
</p>

<p>
According to the ensemble interpretation the probability to measure \(m\) is
</p>

<p>
\[
  p(m) = \sum_j p(m|j) \, p_j = \sum_j \trace{M_m\proj{\psi_j} M_m^\dagger} \, p_j
  = \trace{M_m \rho M_m^\dagger} .
\]
</p>

<p>
Here
</p>

<p>
\[
  p(m|j) = \norm{M_m \ket{\psi_j}}^2 = \trace{M_m \proj{\psi_j} M_m^\dagger}
\]
</p>

<p>
is the conditioned probability to measure \(m\) if we already know that the pure state
\(\psi_j\) was chosen. Suppose we know that we measured \(m\). What is the (mixed) state in
that case? We already know that with (conditioned) probability \(p(j|m)\) the post
measurement state is
</p>

<p>
\[
  \frac{M_m\proj{\psi_j} M_m^\dagger}{p(m|j)} .
\]
</p>

<p>
But this is an ensemble of pure states! Hence, using \(p(m|j)p_j=p(m\cap\,j)=p(j|m)p(m)\),
the corresponding mixed state is
</p>

<p>
\[
  \sum_j p(j|m) \frac{M_m\proj{\psi_j} M_m^\dagger}{p(m|j)}
  = \frac{1}{p(m)} \sum_j p_j M_m\proj{\psi_j} M_m^\dagger
  = \frac{M_m\rho M_m^\dagger}{p(m)}
  = \frac{M_m\rho M_m^\dagger}{\trace{M_m\rho M_m^\dagger}} .
\]
</p>

<p>
This concludes the exercise. But let is briefly mention that in case we do <i>not</i> obtain
the outcome of the measurement the post measurement state is
</p>

<p>
<a id="org4dd03de"></a>
\[
  \sum_{m,j} p(m|j) p_j \, \frac{M_m \proj{\psi_j} M_m^\dagger}{p(m|j)}
  = \sum_m M_m \rho M_m^\dagger .
\]
</p>

<dl class="org-dl">
<dt>Remark</dt><dd><p>
Together with the conclusions from the actual exercise we can draw the
following additional conclusion: If now we somehow obtain the measurement result than
<a href="#org4dd03de">this sum</a> "collapses" into one of its summands (just normalized), with probability
\(\trace{M_m\rho\,M_m^\dagger}\) for each of them. That is, the measurement can be
decomposed into two parts: First the state changes to
</p>

<p>
\[
    \calE(\rho) = \sum_m \calE_m(\rho)
  \]
</p>

<p>
and then (if we obtain the measurement result) the state "collapses" into
\(\calE_m(\rho)/\trace{\calE_m(\rho)}\) for one of the \(m\) with probability
\(\trace{\calE_m(\rho)}\). So, the first part of the measurement can be expressed in terms
of quantum operations. But not the second part (since it is not deterministic and cannot
give rise to a mathematical function on density matrices).
</p></dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-orgbde7759" class="outline-3">
<h3 id="orgbde7759">Exercise 8.3</h3>
<div class="outline-text-3" id="text-orgbde7759">
<p>
Our derivation of the operator-sum representation implicitly assumed that the input and
output spaces for the operation were the same. Suppose a composite system AB initially in
an unknown quantum state \(\rho\) is brought into contact with a composite system CD initially in
some standard state \(\ket{0}\), and the two systems interact according to a unitary interaction
\(U\). After the interaction we discard systems A and D, leaving a state \(\rho'\) of system
BC. Show that the map \(\calE(\rho)=\rho'\) satisfies
</p>

<p>
\[
  \calE(\rho) = \sum_k E_k \rho E_k^\dagger ,
\]
</p>

<p>
for some set of linear operators \(E_k\) from the state space of system AB to the state
space of system BC, and such that \(\sum_kE_k^\dagger\,E_k\).
</p>
</div>
