src/chapter_8.org
*** Proof
Basically we do the same as the book for the special case of equal input and output
space. According to the exercise we have

$$
  \calE(\rho) = \ptrace{AD}{U \rho \otimes \proj{0} U^\dagger} .
$$

Let $\{e_k\}$ be an orthonormal basis of AD. Hence

$$
  \calE(\rho) = \sum_k \bra{e_k} U \rho \otimes \proj{0} U^\dagger \ket{e_k} .
$$

Thus, defining $E_k=\bra{e_k}U\ket{0}$, we have

$$
  \calE(\rho) = \sum_k E_k \rho E_k^\dagger .
$$

That is, $\calE$ has the required form. We only have to show the completeness property
$J:=\sum_kE_k^\dagger\,E_k=I_{AB}$. Note that $J=J^\dagger$ is self-adjoint and
positive-definite. Let $\rho$ be arbitrary and consider

$$
  1 = \ptrace{BC}{\calE(\rho)} = \sum_k \ptrace{BC}{E_k\rho E_k^\dagger}
  = \sum_k \ptrace{AB}{E_k^\dagger E_k \rho}
  = \ptrace{AB}{J^\dagger \rho} .
$$

Here we used the well-known /cyclicity property/ of the trace (which also holds for
(matching) rectangular matrices). Thus

<<exercise-8.3-1>>
$$
  \forall \rho : \; \trace{(J-I)^\dagger \rho} = 0 .
$$

Here the quantification runs over all density operators (hermitian, positive definite,
trace 1).

- Remark :: In case you wonder why I take the adjoint of $J$. We have that
  $S,T\mapsto\trace{S^\dagger\,T}$ turns the matrix space $\CC^{n\times\?n}$ into a
  complex Hilbert space. See e.g. the definition of a Hilbert-Schmidt operator on
  [[https://en.wikipedia.org/wiki/Hilbert%E2%80%93Schmidt_operator][wikipedia]] (it is about infinite dimensional spaces but just note that in finite
  dimensions every operator is a Hilbert-Schmidt operator). For this exercise it does not
  directly help us since the quantification [[exercise-8.3-1][above]] is /not/ over all
  $\rho\in\CC^{n\times\?n}$. But still nice to know 😉.

Considering all rank-1 density matrices $\rho=\proj{\psi}$ we deduce

$$
  \forall \ket{\psi} : \; \trace{(J-I)^\dagger \proj{\psi}} = \bra{\psi} (J-I)^\dagger \ket{\psi} = 0 .
$$

(The first equality can either be seen by the cyclicity property of the trace or by using
an ONB which involves $\psi$ (but normalized) as one of its elements) But this can only be
true (for all normalized $\ket{\psi}$) if $J=I$. QED.

** Exercise 8.4 (Measurement)
:PROPERTIES:
:CUSTOM_ID: exercise-8.4
:END:
Suppose we have a single qubit principal system, interacting with a single qubit
environment through the transform

$$
  U = P_0 \otimes I + P_1 \otimes X
$$

where $X$ is the usual Pauli matrix (acting on the environment), and $P_0\equiv\proj{0}$,
$P_1\equiv\proj{1}$ are projectors (acting on the system). Give the quantum operation for
this process, in the operator-sum representation, assuming the environment starts in the
state $\ket{0}$.

*** Solution
Note that $U$ is nothing else than the =CNOT= gate. Let us label the environment by E. One
way to define the operation elements is

\begin{align*}
  E_0 &= \bra{0_E} U \ket{0_E} = P_0 \sprod{0_E}{0_E} + P_1 \bra{0_E}X\ket{0_E} = P_0 , \\
  E_1 &= \bra{1_E} U \ket{0_E} = P_0 \sprod{1_E}{0_E} + P_1 \bra{1_E}X\ket{0_E} = P_1 .
\end{align*}

(The $\ket{0_E}$ to the right of $U$ comes from the initial state of the environment.)
Hence

$$
  \calE(\rho) = P_0 \rho P_0 + P_1 \rho P_1 = \begin{bmatrix} \rho_{00} & 0 \\ 0 & \rho_{11} \end{bmatrix} .
$$

That is, this operation acts like the first part of a measurement. It describes the state
after a measurement in the Z-basis if nobody tells us the measurement outcome. Once we get
the outcome the state "collapses" to one of the two summands (properly normalized of
course). The respective probabilities are $\rho_{00}$ (for outcome $0$) and $\rho_{11}$
(for outcome $1$).

** Exercise 8.5 (Spin ﬂips)
Just as in the previous exercise, but now let

$$
  U = \frac{1}{\sqrt{2}} \left( X \otimes I + Y \otimes X \right) .
$$

Give the quantum operation for this process, in the operator-sum representation.

*** Solution
First of all let us make sure that $U$ really is unitary. We have $U^\dagger=U$, hence

$$
  U^\dagger U = U^2 = \frac{1}{2} \left( X^2 \otimes I + Y^2 \otimes X^2 + (XY+YX)\otimes X \right) = I .
$$

Hence $U$ is indeed unitary. One way to define the operation elements is as follows:

\begin{align*}
  E_0 &= \bra{0_E} U \ket{0_E} = X \sprod{0_E}{0_E} + Y \bra{0_E}X\ket{0_E} = X , \\
  E_1 &= \bra{1_E} U \ket{0_E} = X \sprod{1_E}{0_E} + Y \bra{1_E}X\ket{0_E} = Y .
\end{align*}

Hence

$$
  \calE(\rho) = \frac{1}{2} \left(X \rho X + Y \rho Y \right)
  = \begin{bmatrix} \rho_{11} & 0 \\ 0 & \rho_{00} \end{bmatrix} .
$$

Interpreting this in the same way as in [[#exercise-8.4][exercise 8.4]] we deduce that $\calE$ corresponds to
a spin-flip followed by a measurement (without obtaining the measurement outcome).

** Exercise 8.6 (Composition of quantum operations)
Suppose $\calE$ and $\calF$ are quantum operations on the same quantum system. Show that
the composition $\calF\circ\calE$ is a quantum operation, in the sense that it has an
operator-sum representation. State and prove an extension of this result to the case where
$\calE$ and $\calF$ do not necessarily have the same input and output spaces.

*** Proof
Suppose

\begin{align*}
  \calE(\rho) &= \sum_i E_i \rho E_i^\dagger , \\
  \calF(\rho) &= \sum_j F_j \rho F_j^\dagger .
\end{align*}

Then

\begin{align*}
  \calF \circ \calE(\rho) = \sum_{ij} F_j E_i \rho E_i^\dagger F_j^\dagger .
\end{align*}

This suggests to use all the $F_jE_i$ as operation elements of the composition. That
$\calF\circ\calE$ is indeed a quantum operation now follows from

$$
  \sum_{ij} E_i^\dagger F_j^\dagger F_j E_i = \sum_i E_i^\dagger E_i = I .
$$

The proof directly generalizes (without any change) to the case where $\calE:A\to\?B$ and
$\calF:B\to\?C$. QED.

** Exercise 8.7
Suppose that instead of doing a projective measurement on the combined principal system
and environment we had performed a general measurement described by measurement operators
$\{M_m\}$. Find operator-sum representations for the corresponding quantum operations
$\{\calE_m\}$ on the principal system, and show that the respective measurement
probabilities are $\trace{\calE_m(\rho)}$.

