src/chapter_8.org
*** Solution
Let $\sigma=\sum_jq_j\proj{j}$ be the state of the environment E. The generalized
operations look as follows

$$
  \calE_m(\rho) = \ptrace{E}{M_m U \rho\otimes\sigma U^\dagger M_m^\dagger} .
$$

According to the posutulates the probability to measure $m$, after an evolution with $U$,
is

$$
  p(m) = \trace{M_m U \rho\otimes\sigma U^\dagger M_m^\dagger} = \trace{\calE_m(\rho)} .
$$

Here we use the property $\trace{\ptrace{E}{A}}=\trace{A}$ of the partial trace. The
post-measurement state for the whole system is is

$$
  \frac{M_m U \rho\otimes\sigma U^\dagger M_m^\dagger}{p(m)} ,
$$

and for the principal system it is

$$
  \ptrace{E}{\frac{M_m U \rho\otimes\sigma U^\dagger M_m^\dagger}{p(m)}}
  = \frac{\calE_m(\rho)}{\trace{\calE_m(\rho)}} .
$$

It is not hard to see that for any choice of an ONB $\{e_k\}$ on E the operators

$$
  E_{jk} = \sqrt{q_j} \bra{e_k} M_m U \ket{j}
$$

are elements for the operation $\calE_m$, which also satisfy
$\sum\?E_{jk}^\dagger\?E_{jk}\leq\?I$:

$$
  \sum_{jk} E_{jk}^\dagger E_{jk}
  = \sum_{jk} q_j \bra{j}U^\dagger M_m^\dagger \ket{e_k} \bra{e_k} M_m U \ket{j}
  = \sum_j q_j \bra{j}U^\dagger M_m^\dagger M_m U \ket{j}
  \leq \sum_j q_j \bra{j}U^\dagger U \ket{j}
  = \sum_j q_j = I .
$$

** Exercise 8.8 (Non-trace-preserving quantum operations)
Explain how to construct a unitary operator for a system–environment model of a
non-trace-preserving quantum operation, by introducing an extra operator, $E_\infty$, into the
set of operation elements $E_k$, chosen so that when summing over the complete set of $k$,
including $k=\infty$, one obtains $\sum_kE_k^\dagger\?E_k=I$.

*** Solution
Let us define

$$
  E_\infty = \sqrt{I - \sum_k E_k^\dagger E_k} .
$$

Clearly $E_\infty^\dagger=E_\infty$ and

$$
  \sum_k' E_k^\dagger E_k = I .
$$

Here and in the following we let $\sum_k'$ denote the sum over all $k$ including
$k=\infty$. On the other hand $\sum_k$ excludes $k=\infty$.

As in the book consider an environment described by a Hilbert space which has a basis
$\{\ket{e_k}\}$ (including $k=\infty$). Define $U$ by

$$
  U \ket{\psi} \ket{e_0} \equiv \sum_k' E_k \ket{\psi} \ket{e_k}
$$

and unitary extension to the full system - exactly as in the book. Consider the following
projection defined on E:

$$
  P = I_E - \proj{e_\infty} .
$$

We shall prove that

$$
  \calE(\rho) = \ptrace{E}{PU \rho\otimes \proj{e_0} U^\dagger P} .
$$

In fact, the RHS equals

$$
  \ptrace{E}{\sum_{kl}' E_k \rho E_l^\dagger \otimes P \ket{e_k}\bra{e_l} P}
  = \ptrace{E}{\sum_{kl} E_k \rho E_l^\dagger \otimes \ket{e_k}\bra{e_l} }
  = \sum_{k} E_k \rho E_k^\dagger
  = \calE(\rho)
$$

as desired.

** Exercise 8.9 (Measurement model)
If we are given a set of quantum operations $\{\calE_m\}$ such that $\sum_m\calE_m$ is
trace-preserving, then it is possible to construct a measurement model giving rise to this
set of quantum operations. For each $m$, let $E_{mk}$ be a set of operation elements for
$\calE_m$. Introduce an environmental system, E, with an orthonormal basis $\ket{m,k}$ in
one-to-one correspondence with the set of indices for the operation elements. Analogously
to the earlier construction, define an operator $U$ such that

$$
  U \ket{\psi} \ket{e_0} = \sum_{mk} E_{mk} \ket{\psi} \ket{m,k} .
$$

Next, deﬁne projectors $P_m=\sum_k\proj{m,k}$ on the environmental system, E.  Show that
performing $U$ on $\rho\otimes\proj{e_0}$, then measuring $P_m$ gives $m$ with probability
$\trace{\calE_m(\rho)}$, and the corresponding post-measurement state of the principal
system is $\calE_m(\rho)/\trace{\calE_m(\rho)}$.

*** Solution
That $U$ can be extended to a unitary operator can be seen as in the other cases of
constructing an environment model. We have

\begin{align*}
  \ptrace{E}{P_m U \rho \otimes \proj{e_0} U^\dagger P_m}
  &= \ptrace{E}{\sum_{m,k,l} E_{mk}\rho E_{ml}^\dagger \otimes \ket{m,k}\bra{m,l}} \\
  &= \sum_{m,k} E_{mk}\rho E_{mk}^\dagger \\
  &= \calE_m(\rho) .
\end{align*}

Hence, using $\trace{\ptrace{E}{\ldots}}=\trace{\ldots}$, the probability to measure $m$
after applying $U$ to $\rho\otimes\proj{e_0}$ is

$$
  p(m) = \trace{P_m U \rho \otimes \proj{e_0} U^\dagger P_m} = \trace{\calE_m(\rho)} .
$$

The post-measurement state of the whole system is

$$
  \frac{P_m U \rho \otimes \proj{e_0} U^\dagger P_m}{p(m)} .
$$

Taking the partial trace of the environment yields the post-measurement state of the
principal system

$$
  \frac{\ptrace{E}{P_m U \rho \otimes \proj{e_0} U^\dagger P_m}}{p(m)}
  = \frac{\calE_m(\rho)}{\trace{\calE_m(\rho)}} .
$$
